nonfree.html
<!doctype html>
<html lang="en">
<head>
<title>NonFree Blog Testing</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jay Kamat">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="src/jgkamat.css"> <link href="https://fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">NonFree Blog Testing</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">NonFree Software</h2>
<div class="outline-text-2" id="text-1">
<p>
This page is mostly for testing out their usage, and evaluating whether it is worth including it into the rest of the blog.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><a href="https://txtpen.com/">txtpen</a></h2>
<div class="outline-text-2" id="text-2">
<p>
Seems to be an easy to use highlighting tool
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Pros</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Easy installation
</li>
<li>Allows users to comment and interact with page
</li>
<li>Requires no infrastructure on website's part
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Cons</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Breaks footer colors
<ul class="org-ul">
<li>I'll probably report this at some point, but <code>!important</code> fixes it for now
</li>
</ul>
</li>
<li>Request to website must track users in some way
</li>
<li>Dosen't seem to work always (when highlighting quickly)
</li>
<li>Requires users use a google or txtpen account to highlight content
</li>
<li>Requires javascript
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="label label-primary TODO">TODO</span> Test</h2>
<div class="outline-text-2" id="text-3">
<p>
Here's some testing stuff to see if this will break!
</p>

<ul class="org-ul">
<li>Source code blocks
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5e6263;">#</span><span style="color: #5e6263;">!/bin/</span><span style="color: #598249;">bash</span>
<span style="color: #598249;">echo</span> <span style="color: #15968D;">"My name is Jay"</span> | sed <span style="color: #15968D;">'s/Jay/&amp; Kamat/'</span>
<span style="color: #598249;">if</span> false; <span style="color: #598249;">then</span>
    <span style="color: #598249;">echo</span> hi
<span style="color: #598249;">fi</span>
</pre>
</div>
</li>
<li>Tables
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">One</th>
<th scope="col" class="text-left">Two</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">three</td>
<td class="text-left">four</td>
</tr>

<tr>
<td class="text-left">five</td>
<td class="text-left">six</td>
</tr>
</tbody>
</table>
</li>
<li>Quotes
<blockquote>
<p>
"There is no such thing as a typical user, and if there were, it wouldn't be you"
</p>

<p>
#usability
</p>
</blockquote>
</li>
<li>\(\LaTeX\)

<p>
Assume \(\alpha=9\), \(n=16\) and \(x=0\).
</p>

<p>
Stack grows until base case \(2^{x}=n\).
</p>
</li>
<li>Some org Special Chars

<p>
&alpha; &beta; &rarr; &larr; &le; &ge; &sigma; &Sigma;
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
Let me know via email or the txtpen highlights if you have any comments or concerns!
</p>


<script src="https://txtpen.com/embed.js?site=jgkamat"></script>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">NonFree Software</a></li>
<li><a href="#sec-2">txtpen</a>
<ul class="nav">
<li><a href="#sec-2-1">Pros</a></li>
<li><a href="#sec-2-2">Cons</a></li>
</ul>
</li>
<li><a href="#sec-3">Test</a></li>
<li><a href="#sec-4">Conclusion</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">

<div>
<p class="author">Author: <a href="https://github.com/jgkamat/jgkamat.github.io">Jay Kamat</a></p>
<p class="date">Published: 2017-04-13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
